# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения,
# город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.


def userInfo(name, surname, year, city, email, telephone):
    return " ".join([name, surname, year, city, email, telephone])


name = input('Введите имя: ')
surname = input('Введите фамилию: ')
year = input('Введите год рождения: ')
city = input('Введите город проживания: ')
email = input('Введите email: ')
telephone = input('Введите телефон: ')

print(userInfo(name, surname, year, city, email, telephone))
